["```sh       This document first appeared as a 60-page HOWTO in the late spring\n      of 2000\\. Since then, it has gone through quite a number of updates\n      and revisions. This book could not have been written without the\n      assistance of the Linux community, and especially of the volunteers\n      of the Linux Documentation Project.\n\n```", "```sh From thegrendel@theriver.com Sat Jun 10 09:05:33 2000 -0700\nDate: Sat, 10 Jun 2000 09:05:28 -0700 (MST)\nFrom: \"M. Leo Cooper\" <thegrendel@theriver.com>\nX-Sender: thegrendel@localhost\nTo: ldp-discuss@lists.linuxdoc.org\nSubject: Permission to submit HOWTO\n\nDear HOWTO Coordinator,\n\nI am working on and would like to submit to the LDP a HOWTO on the subject\nof \"Bash Scripting\" (shell scripting, using 'bash'). As it happens,\nI have been writing this document, off and on, for about the last eight\nmonths or so, and I could produce a first draft in ASCII text format in\na matter of just a few more days.\n\nI began writing this out of frustration at being unable to find a\ndecent book on shell scripting. I managed to locate some pretty good\narticles on various aspects of scripting, but nothing like a complete,\nbeginning-to-end tutorial.  Well, in keeping with my philosophy, if all\nelse fails, do it yourself.\n\nAs it stands, this proposed \"Bash-Scripting HOWTO\" would serve as a\ncombination tutorial and reference, with the heavier emphasis on the\ntutorial. It assumes Linux experience, but only a very basic level\nof programming skills. Interspersed with the text are 79 illustrative\nexample scripts of varying complexity, all liberally commented. There\nare even exercises for the reader.\n\nAt this stage, I'm up to 18,000+ words (124k), and that's over 50 pages of\ntext (whew!).\n\nI haven't mentioned that I've previously authored an LDP HOWTO, the\n\"Software-Building HOWTO\", which I wrote in Linuxdoc/SGML. I don't know\nif I could handle Docbook/SGML, and I'm glad you have volunteers to do\nthe conversion. You people seem to have gotten on a more organized basis\nthese last few months. Working with Greg Hankins and Tim Bynum was nice,\nbut a professional team is even nicer.\n\nAnyhow, please advise.\n\nMendel Cooper\nthegrendel@theriver.com\n```"]